In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 复习

In [2]:
s1 = Series(['小王','一班','小李','二班'],index = [[1,1,2,2],['姓名','班级','姓名','班级']])
s1

1  姓名    小王
   班级    一班
2  姓名    小李
   班级    二班
dtype: object

In [3]:
s1[2]['姓名'] # 直接法

'小李'

In [4]:
s1.loc[2]['姓名'] # loc标签取值法

'小李'

In [5]:
arr_2d = np.array([['小张', '男', 20], ['小李', '男', 19], ['小王', '女', 21], ['小余', '女', 18]])
d1 = DataFrame(arr_2d, columns = ['姓名','性别','年龄'],
               index = pd.MultiIndex.from_tuples ([('一班','班长'),('一班','学习委员'),('二班','班长'),('二班','学习委员')]))
d1

         姓名 性别  年龄
一班 班长    小张  男  20
   学习委员  小李  男  19
二班 班长    小王  女  21
   学习委员  小余  女  18

In [6]:
d1['年龄']

一班  班长      20
    学习委员    19
二班  班长      21
    学习委员    18
Name: 年龄, dtype: object

In [7]:
type(d1['年龄']) # pandas.core.series.Series

pandas.core.series.Series

In [8]:
d1.loc['一班']

      姓名 性别  年龄
班长    小张  男  20
学习委员  小李  男  19

# 一.Pandas运算

## 1.Series + Series

In [9]:
s1 = Series(np.arange(4), index=['a', 'c', 'e', 'd'])
s1

a    0
c    1
e    2
d    3
dtype: int32

In [10]:
s2 = Series([3, -6, 6, -1], index=['a', 'b', 'c', 'd'])
s2

a    3
b   -6
c    6
d   -1
dtype: int64

In [11]:
s1 + s2 # 没有对齐的均用NaN填充

a    3.0
b    NaN
c    7.0
d    2.0
e    NaN
dtype: float64

## 2.DataFrame + DataFrame

In [12]:
d1 = DataFrame(np.arange(9).reshape(3,3), columns=['a', 'b', 'c'], index=['一','二','三']) 
d1

   a  b  c
一  0  1  2
二  3  4  5
三  6  7  8

In [13]:
d2 = DataFrame(np.arange(12).reshape(3,4), columns=['a', 'b', 'c', 'd'], index=['四','一','三']) 
d2

   a  b   c   d
四  0  1   2   3
一  4  5   6   7
三  8  9  10  11

In [14]:
d1 + d2

      a     b     c   d
一   4.0   6.0   8.0 NaN
三  14.0  16.0  18.0 NaN
二   NaN   NaN   NaN NaN
四   NaN   NaN   NaN NaN

## 3.Series + DataFrame

In [15]:
s1 + d1 # 将Series的索引与DataFrame对象列名称相同的元素进行运算, 没有对齐的用NaN补充

     a   b    c   d   e
一  0.0 NaN  3.0 NaN NaN
二  3.0 NaN  6.0 NaN NaN
三  6.0 NaN  9.0 NaN NaN

# 二.函数的应用

## 1.map

In [16]:
s1 = Series([5.0, -2, 4.4, 3.4], index=['a', 'b', 'c', 'd'])
s1

a    5.0
b   -2.0
c    4.4
d    3.4
dtype: float64

In [17]:
f = lambda x: x+5
s1.map(f)

a    10.0
b     3.0
c     9.4
d     8.4
dtype: float64

In [18]:
d2 = DataFrame(np.arange(12).reshape(3,4), columns=['a', 'b', 'c', 'd'], index=['四','一','三']) 
d2

   a  b   c   d
四  0  1   2   3
一  4  5   6   7
三  8  9  10  11

In [19]:
f = lambda x: -x
d2['c'].map(f) # 指定'C'列 元素变为负

四    -2
一    -6
三   -10
Name: c, dtype: int64

In [20]:
d2.loc['四'].map(f) # 指定'四'行 元素变为负

a    0
b   -1
c   -2
d   -3
Name: 四, dtype: int64

## 2.排序和排名

### (1)排序

In [21]:
s1 = Series([5.0, -2, 4.4, 3.4], index=['a', 'c', 'd', 'b'])
s1

a    5.0
c   -2.0
d    4.4
b    3.4
dtype: float64

In [22]:
s1.sort_index() # 按索引排序, 缺省是升序(ascending=True)

a    5.0
b    3.4
c   -2.0
d    4.4
dtype: float64

In [23]:
s1.sort_index(ascending=False) # ascending=False是降序

d    4.4
c   -2.0
b    3.4
a    5.0
dtype: float64

In [24]:
s1.sort_values() # 按值排序

c   -2.0
b    3.4
d    4.4
a    5.0
dtype: float64

In [25]:
s1.sort_values(ascending=False)

a    5.0
d    4.4
b    3.4
c   -2.0
dtype: float64

In [26]:
d1 = DataFrame(np.arange(9).reshape(3,3), columns=['c', 'a', 'b'], index=['B','C','A']) 
d1

   c  a  b
B  0  1  2
C  3  4  5
A  6  7  8

In [27]:
d1.sort_index() # 按行索引排序

   c  a  b
A  6  7  8
B  0  1  2
C  3  4  5

In [28]:
d1.sort_index(axis=1) # 按列索引排序, 缺省axis=0, 按行

   a  b  c
B  1  2  0
C  4  5  3
A  7  8  6

In [29]:
d1.sort_values(by='b', ascending=False)

   c  a  b
A  6  7  8
C  3  4  5
B  0  1  2

## (2)排名

In [30]:
s1 = Series([7, 4, 5, 1], index=['a','c','d','b'])
s1

a    7
c    4
d    5
b    1
dtype: int64

In [31]:
s1.rank() # 缺省按升序排名

a    4.0
c    2.0
d    3.0
b    1.0
dtype: float64

In [32]:
s1.rank(ascending=False) # 按降序排名

a    1.0
c    3.0
d    2.0
b    4.0
dtype: float64

In [33]:
s1 = Series([7, 5, 5, 1], index=['a','c','d','b']) # 有重复值
s1

a    7
c    5
d    5
b    1
dtype: int64

In [34]:
s1.rank(ascending=False) # 按降序排名

a    1.0
c    2.5
d    2.5
b    4.0
dtype: float64

In [35]:
s1.rank(ascending=False, method='first') # 按降序排名, 重复值先出现的排名高

a    1.0
c    2.0
d    3.0
b    4.0
dtype: float64

In [36]:
s1.rank(ascending=False, method='min') # 按降序排名, 重复值排名并列

a    1.0
c    2.0
d    2.0
b    4.0
dtype: float64

In [37]:
s1.rank(ascending=False, method='dense') # 按降序排名, 重复值排名并列, 下一名的名次为上一名+1

a    1.0
c    2.0
d    2.0
b    3.0
dtype: float64